config.org
#+title: Config.el
#+AUTHOR: Tobias Os Finsbøl
#+PROPERTY: header-args :tangle config.el

* AUTHOR
Her setter jeg navnet jeg bruke når jeg tar #+AUTHOR og da vil emacs finne til riktig navn.
#+begin_src emacs-lisp
(setq user-full-name "Tobias Os Finsbøl"
      user-mail-address "tobias.finsbol@gmail.com")
#+end_src

* Fonts
Her setter jeg fonter
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Source Code Pro" :size 12)
      doom-variable-pitch-font (font-spec :family "Source Code Pro" :size 12)
      doom-big-font (font-spec :family "Source Code Pro" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(after! org
  (setq org-hide-emphasis-markers t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

* Themes
Her setter jeg theme.
#+begin_src emacs-lisp 
(setq doom-theme 'doom-dracula)
#+end_src

* Line nummer
Her aktiverer jeg linje nummer.
#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

* Org
Her setter jeg Org settings
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

* Beacon
En plugin for se for min cursor er til en hver tid. Note du må laste ned beacon via M-x og package-install. 
#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

